using System;

namespace eebot_CSharp
{
    public static class cxk
    {
        public static string[] sbres = new string[] {
            "c—里", "聊天室里", "厕所", "一堆JSON数据中", "紅色的森林",
            "电脑病毒中", "窗前", "牵牛花凋零之时", "揉成团的纸上",
            "废弃矿井", "赤道上", "海平面上", "窗外", "空中网中",
            "上海", "雨中", "绿油油的草地上", "违规的边界线上",
            "挂机列表里", "浮士德的噩梦中", "破晓时分", "金三角广场", "傻鸟待过的树上", "大连公交上", "爱丽丝的记事本里", "战场上",
            "MC服务器里", "这个罪中", "无声的夜里", "中二病爆发期间", "这场戏里", "夕阳下", "虚无缥缈的互联网中", "黄昏下", "雪中",
            "鱼居住的池塘里", "阴阳逆乱时", "彩虹下", "你家", "恶魔的控制下", "e—家", "庭院中", "无人之境", "天堂", "你家门口", "深海",
            "于馆中", "地狱", "隔壁", "三棱镜中", "女王的脚步声中", "教室", "新世界神的指引下", "天使的祝福下", "树屋里", "欧罗赫丝的梦中",
            "农场", "大街上", "无法识别的字符中", "命运石之门的选择下", "河里", "魔女之家", "柏林墙上", "轮回中", "梦日记里", "灰烬之棺",
            "灰色庭院", "深夜零時", "噬人的白昼中", "绝望的都市", "深海里", "告白日", "MC边境", "天上", "唐山反鱼集团总部", "宇宙中",
            "天空之城", "银河系", "太阳系", "曾经繁华的火星", "另一个地球", "你的屏幕前", "幻想少女的糖果屋", "电脑里", "不现实的想法中",
            "第三世界", "街角的小酒吧", "反鱼类联盟中", "电脑前", "立夏时分", "奇怪的网络世界", "童话的白日梦中", "闹鬼的玉米迷宫里",
            "初墨的电脑里", "芒种时分", "电视里", "手机前", "苍之彼方", "鲸鱼背上", "高先生的好果汁店中", "MC智障村", "我的世界",
            "运行中", "地平线上", "地平线尽头", "2000年前", "网络上", "你的电脑桌面上", "原始社会", "如液体般清凉的早晨", "鱼背上",
            "你出生时", "失落的圣诞节", "可执行文件里", "逝去的未来", "完美的世界", "大鹏的背上", "梦中", "没有未来的未来",
            "曾几何时", "404页面上", "雾雨之森", "金工街三号楼里", "樱花雨中", "5000年前", "纸巾盒里", "樱花树下", "人偶师的手下",
            "鱼缸里", "win27窗口里", "zc初墨服务器里", "第二匹彩色的马诞生的七天后", "不可思议之国", "冒险酒馆", "冒险者协会",
            "光中", "风闻小镇", "废都", "六平路五号楼里", "观赏鱼保护协会里", "B站视频里", "充满光线的晴天", "空无一人的世界",
            "寒冬夜", "无色之黑里", "只有我在的地方", "zzChat里", "童话里", "梦狱之国", "小卖部", "99度中", "txt文档里",
            "exe文件里", "MC里", "疯狂星期四", "茶杯里", "文件夹里", "你想不到的地方", "虚拟世界", "蔷薇花园里",
            "魔王城", "一路上", "十字街口", "否认自己是机器人", "壹伍肆超市", "信鸽homer里", "世界末日", "终末",
            "那天那夜", "风暴平息后", "自己的墓中", "雪白的云上", "墓地", "雪原上", "人间", "你的帮助下", "你身上",
            "异世界", "人生重开模拟器中", "流星划过夜空时", "世末", "你眼中", "你身边", "一个人在家时", "彼岸的时间", "说书人的童话故事中", "秘境茶会中", "中世纪", "文艺复兴期间", "未来世界", "黑洞里", "莫比乌斯的反面", "今天", "樱花的月夜", "流浪地球", "朝阳下", "寂静的夜晚", "月球上", "雨宿公车站", "这个错误的世界", "·", "和你聊天", "渴望一个奇迹", "玩着一个人的捉迷藏", "成为来自天堂的魔鬼", "留了一个小号", "殴打云中心主任", "翻黑历史", "缩小至细胞的大小", "推着1千克的Mxmxxx", "做着游梦症", "成为地牢探险家",
            "融化了魔女", "截图留证", "聆听羽翼的祈愿", "以谎言为食", "被清零了", "被异化之恶所包围", "瞄准你发射了导弹~芜湖", "引爆了一颗原子弹", "引爆了一颗氢弹", "与月共舞", "捡到了御我神的镜子", "成为世界首富", "看Beluga的视频", "托腮.jpg", "成为天才他爹", "拾起龙之泪", "发生了核聚变", "返老还童成了一颗蛋", "听着夜弦之音", "打开答案之书", "开外挂", "自动重启", "听Midix的电音", "吹牛逼", "笑容逐渐凝固", "窥屏", "成为了隐居的参谋", "购买雨云服务器被初墨打劫提权root抢走", "被黑了电脑", "玩嘎嘎游戏", "开飞机~芜湖",
            "将生命与荣耀献给守夜人", "被溺爱了", "重新开始了人生", "等待下一秒的终极", "吃校门口的烤串", "打广告", "打开404网页", "见到了无面的达布尔", "南草滩", "成为魔女的药引", "躺平", "数着四重罪孽", "折了羽", "吃零食", "写下无名情书", "发出SOS求救信号", "成为孤勇者", "天体观测", "打游戏", "蹲坑", "查收了猪先生的包裹", "寻找过去的一切", "大喊666", "99°的水中溺亡", "和你一起听歌", "接受了你的答案", "走向平凡", "安排懒羊羊的一天", "成为罪恶的天使", "开直升机~芜湖", "听着破碎的雨音",
            "屠尽天下", "敲键盘", "为无尽的雨献上花束", "听你的故事", "守护你", "看见了别西卜", "不断作死", "唱着终末之歌", "上厕所", "卡死了 awa", "写作业写到凌晨12点", "拔草", "因重复挂机被移出了挂机列表", "种草", "追你~", "结束了运行", "成了人工智障", "所念的皆是星河", "诉说着生死一舞的爱语", "智商为0", "将鱼捆绑在烤串上", "转圈圈~", "坠入爱河", "成为一只小蝌蚪", "摔倒后脑勺", "被记忆欺骗了", "上体育课", "用冰冻鱼浇筑地狱门", "排泄", "收试卷", "吃蓝色的橙子", "哈哈大笑", "被jill胶水喝了", "毁灭了世界",
            "被世界毁灭了", "钓Qwer", "放屁", "被化学老师化合反应了", "和你发生了置换反应", "乘风归来", "做白日梦", "谈恋爱", "成为了杠杠的支点", "看书中不现实的理想", "看报纸中世界终结的日期", "向你要抱抱", "向你要举高高", "自由地飞翔", "与暗焰魔法使缔结契约", "和你打招呼", "喜欢Mark", "用铠甲封闭自己的内心", "同时接到清华北大录取通知书", "被哈利波特魔法学院录取了", "晒鱼干", "发现自己竟然不是人", "发现自己竟然是机器人", "摸鱼", "尝试学e—画画", "做黑暗料理", "看e—做黑暗料理", "尝试模仿bo_od", "捡到神大人的心脏",
            "在一模中emo了", "被名为二模的恶魔击败了", "成为魔法少女", "烤鱼", "收到了鸟的来信", "收到远方的朋友寄来的信", "成为DJ我", "吃完了核桃后不愿工作了", "和你早恋", "听着今天的风甚为喧嚣", "打开乐园之门", "钓鱼", "烹饪观赏鱼", "当一个好孩子", "吃鱼", "捉鱼", "变成了瓜娃娃", "套娃", "与他仅有一面之缘", "摸摸你", "摸你的头", "和Mark领了红本本", "想被摸摸头", "喝了一口H2O", "呆呆望着你", "黑茶煮鱼", "捡到了你的漂流瓶", "接收到你的电波~", "发送哔哩哔哩的电波", "写给你的邮件", "注视着你", "看着e—写代码", "想想还有什么新功能",
            "夸你的软件很棒", "觉得你很可爱", "和Mark在一起了", "比较病毒和细胞的大小", "为王的诞生献上礼炮", "觉得你是小天使", "希望成为小天使", "被漆黑烈焰围绕", "听心的声音", "被表白了", "被认为是小恶魔了", "分解了宇宙", "寻找着何为爱的含义", "有喜欢的人了", "试图找到空隙逃跑", "点开了桌面冰敦敦", "对神明祈祷", "寻找函数的终点", "遵从了命运", "可怜弱小但能吃", "成为反派女主", "变成男孩子后女装了", "与你散步", "被浩如烟海的数据流冲走了", "喝jill胶水", "和你在一起", "想变得可爱", "想被你喜欢", "呼吁言论自由",
            "盯着你", "喝雪柚橘子味的脉动", "发现纳米居然是一种新型大米", "跳来跳去", "被魔改直呼被骗", "被给予了思念", "购买深海小黄鱼干", "觉得你很棒", "觉得你很厉害", "希望你再接再厉", "入侵了MC服务器", "呼吁深海小黄鱼应成为X级保护动物", "被暗网访问了", "喝亚麻籽油", "尝试自己删除自己", "尝试改写自己的程序", "身上开满了花", "萌生了憎恶", "为你痴狂", "激活了win27系统", "迷失在馆中", "尝试给e—多写点BUG", "被吃了 awa", "制作jill胶水", "打败了晨雾与苏格兰的狮子", "倒映着深潭的眼眸", "进入了梦乡", "看不见曾经的恋人", "吃了你",
            "走向光明", "被埋葬在油菜花的田野", "听温柔至极的音乐", "挖你的坟", "跳hop", "成为了你的鸟笼", "听秒针滴滴答答的声音", "断开了网线", "挂断了跨越时间的电话", "迷失在黑蝶幻境", "迷失在灰鹰幻境", "和你弹着二重奏", "参观中考考场", "埋下时间胶囊", "写着给未来自己的一封信", "对语文作文很头疼", "花一小时写了一道数学题", "研究发现人类唾液或可分解塑料", "学习网络安全技术", "将奥利奥扭一扭", "走在世界前列", "吃奥利给", "吃蛋糕酱", "上天入地无所不能", "试试后逝世了", "钓你~愿者上钩", "在想线圈和鱼哪个更好吃", "淋雨一直走", "在监狱中捞你",
            "孤独地歌唱", "看到扭曲的脸", "想成为虚拟歌姬", "看到名为慕容的猪", "瞪大了双眼", "拆不开礼物", "坐着大佬的坐姿", "不吃鱼", "带走的不止是混乱", "游走在两扇万花筒中间", "分不清梦境的意义", "发可爱的颜文字 n(*≧▽≦*)n", "发可爱的三字母表情 uwu", "见到了手持镰刀的塔纳托斯", "一个人发呆", "穿越时空 回到了8岁时", "无法锁住自由的心", "看到有人抹黑XChat以及XChat用户", "召唤了M78星云的怪兽", "感受到明天太阳的温暖", "空想时间的某一天", "回到过去", "迷失了方向", "见证了阿瓦国的诞生", "见证的阿瓦语的演变", "梦到了不会404的智械零姬", "被e—夸了",
            "清晰可辨十字架上的风尘", "和我的狗一样彷徨", "成为自己的模样", "像猎鹰般不可爱地飞起", "乱刷屏", "喝初生的墨水", "看到卢本伟被愤怒的小张处决", "回想起过去", "叠了十三只用纸片做成的鱼", "哼着无名的歌谣", "看着你偷偷笑", "临风而行", "逆风而行", "逆光向前", "亲眼看见李桂鱼锐变成大鹏", "亲眼听见大鹏拂过的气息呼啸的声音", "运行彩虹猫病毒", "找不到人", "科学上网", "踹了你一脚", "发送涉黄内容", "唱最炫民族风", "跳新宝岛", "随意攻击某人", "搞比利", "晒太阳", "好好学习", "见到了加穆", "的现实生活太过于充实", "进行社会活动", "觉醒了邪王之眼", "突然觉得右眼好痛", "召唤了魔王", "召唤了精灵王", "和你打牌",
            "当上海贼王", "被你踹了一脚", "眨着眼睛", "和你一起旅行", "想念你", "摘名为tctd的星", "想见你", "与带刺的蔷薇对话", "读着格林童话", "看不到未来", "陪你看星星", "见到若隐若现的幽灵", "钻进哆啦A梦的口袋", "和你散步", "喝蜜雪冰城", "吃麻辣烫", "买小笼包", "卖报纸", "停止了运行", "被查水表", "因网络原因进进出出", "进化成为最强蜗牛", "盗用他人昵称", "把你变成了猪", "被合成了", "和你看落日", "遇见了你", "和你看日出", "看你写代码", "跳着命运的华尔兹", "和你贴贴", "吃狗粮", "看小情侣打打闹闹", "心情很好", "获得了吉尼斯废话最多的世界纪录",
            "参加北京冬奥会", "打败了自己", "仰视你~", "思考人生中", "不想当机器人了", "喝了一口黑茶", "跨越时间和空间的界限", "过度使用bot", "吃了一张纸片", "做化学实验", "成为了永恒", "写物理题", "看见另一个我", "看和你看烟花", "看着樱花飘落", "喝死尸酒", "解剖菜豆种子", "重读上下五千年", "以史为鉴", "被风干成了纸片", "使用显微镜对光中", "打磨铝片", "看小蝌蚪找妈妈", "找某xc的BUG", "长出了44FF00色的ww", "挖彩蛋", "放逐了这个世界", "看见张三被判无期徒刑", "挖洞钻进去", "吃氧化钙", "随机傻逼句子", "挖方块", "徒手挖黑曜石中", "看见苦力怕炸房子",
            "发现家被苦力怕炸了", "盗用你的头像", "从空中跌落", "被闪电劈死", "触碰到了星辰", "被你镶进了玻璃里", "在逃离僵尸的途中不幸淹死了", "被仙人掌戳死", "捉傻鸟 :)", "打开名叫Light的灯", "写下一首名为无题的诗", "挑战你的底线", "被屏蔽了", "拾起西边的贝壳", "掉出了世界", "被TNT炸死", "被优雅蒙蔽了双眼", "诈尸了", "想你想到快窒息", "批评中国式家长的教育方式", "接受了汝的契约", "将你拥入怀中", "落地过猛", "睁大了双眼", "被神明选择了", "想吃泡面但泡面没给调料包", "敲了敲门", "被自己杀死", "被坠落的铁砧压扁", "浴火焚身", "在墙里窒息", "被女巫的魔法杀死", "见证过数千个太阳的光芒", "被凋零凋零了", "被丘比特的箭射中了", "" };
        public static string Random()
        {
            return
                sbres[new Random((int)DateTime.Now.Ticks).Next(0, sbres.Length)] +
                sbres[new Random((int)DateTime.Now.Ticks).Next(0, sbres.Length)] +
                sbres[new Random((int)DateTime.Now.Ticks).Next(0, sbres.Length)];
        }
        public static string RandomSinge()
        {
            return sbres[new Random((int)DateTime.Now.Ticks).Next(0, sbres.Length)];
        }
    }

}